sorosaulong-ux/gd32-test-project/Start/startup_gd32a74xx.s
;/* external interrupts handler */
WWDGT0_IRQHandler
HVD_LVD_IRQHandler
RTC_Alarm_IRQHandler
RTC_IRQHandler
FMC_IRQHandler
RCU_IRQHandler
EXTI0_IRQHandler
EXTI1_IRQHandler
EXTI2_IRQHandler
EXTI3_IRQHandler
EXTI4_IRQHandler
DMA0_Channel0_IRQHandler
DMA0_Channel1_IRQHandler
DMA0_Channel2_IRQHandler
DMA0_Channel3_IRQHandler
DMA0_Channel4_IRQHandler
DMA0_Channel5_IRQHandler
DMA0_Channel6_IRQHandler
ADC0_IRQHandler
CAN0_Message_IRQHandler
CAN0_IRQHandler
CPU_INT0_IRQHandler
CPU_INT1_IRQHandler
CPU_INT2_IRQHandler
CPU_INT3_IRQHandler
CAN0_WKUP_IRQHandler
TIMER0_BRK_UP_TRG_CMT_IRQHandler
TIMER2_IRQHandler
TIMER1_IRQHandler
TIMER19_BRK_UP_TRG_CMT_IRQHandler
JDC_IRQHandler
I2C0_EV_IRQHandler
I2C0_ER_IRQHandler
I2C1_EV_IRQHandler
I2C1_ER_IRQHandler
SPI0_IRQHandler
SPI1_IRQHandler
USART0_IRQHandler
USART1_IRQHandler
USART2_IRQHandler
EXTI10_15_IRQHandler
EXTI5_9_IRQHandler
TAMPER_IRQHandler
TIMER20_BRK_UP_TRG_CMT_IRQHandler 
EXTI42_101_IRQHandler
TIMER7_BRK_UP_TRG_CMT_IRQHandler
PLL_LOL_DES_RESET_IRQHandler
DMAMUX_OVR_IRQHandler
FPU_WAB_IRQHandler
CMP0_EXTI_IRQHandler
CMP1_EXTI_IRQHandler
FMU_INIT_IRQHandler
ADC1_IRQHandler
ADC2_IRQHandler
DAC0_IRQHandler
STCM_IRQHandler
DMA1_Channel0_IRQHandler
DMA1_Channel1_IRQHandler
DMA1_Channel2_IRQHandler
DMA1_Channel3_IRQHandler
DMA1_Channel4_IRQHandler
WWDGT1_IRQHandler
CAN1_WKUP_IRQHandler
CAN1_Message_IRQHandler
CAN1_IRQHandler
CTI0_IRQHandler
CTI1_IRQHandler
CAN0_ECCERR_IRQHandler
CAN1_ECCERR_IRQHandler
CAN2_ECCERR_IRQHandler
MFCOM_IRQHandler
CMP0_IRQHandler
CMP1_IRQHandler
SENT_IRQHandler
HWSEM_IRQHandler
CAN3_ECCERR_IRQHandler
CAN4_ECCERR_IRQHandler
DAC1_IRQHandler
HSM_COM0_IRQHandler
HSM_COM1_IRQHandler
FMU_CAT_IRQHandler
RCTL_IRQHandler
IOC_IRQHandler
SPI2_IRQHandler
SPI3_IRQHandler
SPI4_IRQHandler
SPI5_IRQHandler
SPI6_IRQHandler
SPI7_IRQHandler
QSPI_IRQHandler
USART3_IRQHandler
USART4_IRQHandler
USART5_IRQHandler
CAN2_WKUP_IRQHandler
CAN3_WKUP_IRQHandler
CAN4_WKUP_IRQHandler
CAN5_WKUP_IRQHandler
CAN6_WKUP_IRQHandler
CAN7_WKUP_IRQHandler
CAN2_Message_IRQHandler
CAN2_IRQHandler
CAN3_Message_IRQHandler
CAN3_IRQHandler
CAN4_Message_IRQHandler
CAN4_IRQHandler
CAN5_Message_IRQHandler
CAN5_IRQHandler
CAN6_Message_IRQHandler
CAN6_IRQHandler
CAN7_Message_IRQHandler
CAN7_IRQHandler
TIMER19_CC0_CC0N_IRQHandler
TIMER19_CC1_CC1N_IRQHandler
TIMER19_CC2_CC2N_IRQHandler
TIMER19_CC3_CC3N_IRQHandler
TIMER20_CC0_CC0N_IRQHandler
TIMER20_CC1_CC1N_IRQHandler
TIMER20_CC2_CC2N_IRQHandler
TIMER20_CC3_CC3N_IRQHandler
TIMER60_CC0_CC0N_IRQHandler
TIMER60_CC1_CC1N_IRQHandler
TIMER60_CC2_CC2N_IRQHandler
TIMER60_CC3_CC3N_IRQHandler
TIMER61_CC0_CC0N_IRQHandler
TIMER61_CC1_CC1N_IRQHandler
TIMER61_CC2_CC2N_IRQHandler
TIMER61_CC3_CC3N_IRQHandler
TIMER62_CC0_CC0N_IRQHandler
TIMER62_CC1_CC1N_IRQHandler
TIMER62_CC2_CC2N_IRQHandler
TIMER62_CC3_CC3N_IRQHandler
TIMER63_CC0_CC0N_IRQHandler
TIMER63_CC1_CC1N_IRQHandler
TIMER63_CC2_CC2N_IRQHandler
TIMER63_CC3_CC3N_IRQHandler
DMA0_Channel7_IRQHandler
DMA0_Channel8_IRQHandler
DMA0_Channel9_IRQHandler
DMA0_Channel10_IRQHandler
DMA0_Channel11_IRQHandler
DMA0_Channel12_IRQHandler
DMA0_Channel13_IRQHandler
DMA0_Channel14_IRQHandler
DMA0_Channel15_IRQHandler
DMA1_Channel5_IRQHandler
DMA1_Channel6_IRQHandler
DMA1_Channel7_IRQHandler
DMA1_Channel8_IRQHandler
DMA1_Channel9_IRQHandler
DMA1_Channel10_IRQHandler
DMA1_Channel11_IRQHandler
DMA1_Channel12_IRQHandler
DMA1_Channel13_IRQHandler
DMA1_Channel14_IRQHandler
DMA1_Channel15_IRQHandler
MCMUA_RX_IRQHandler
MCMUA_TX_IRQHandler
MCMUA_NORMAL_IRQHandler
MCMUB_RX_IRQHandler
MCMUB_TX_IRQHandler
MCMUB_NORMAL_IRQHandler
LIN0_IRQHandler
LIN1_IRQHandler
LIN2_IRQHandler
LIN3_IRQHandler
LIN4_IRQHandler
LIN5_IRQHandler
LIN6_IRQHandler
LIN7_IRQHandler
LIN8_IRQHandler
LIN9_IRQHandler
LIN10_IRQHandler
LIN11_IRQHandler
TIMER0_CC0_CC0N_IRQHandler
TIMER0_CC1_CC1N_IRQHandler
TIMER0_CC2_CC2N_IRQHandler
TIMER0_CC3_CC3N_IRQHandler
TIMER7_CC0_CC0N_IRQHandler
TIMER7_CC1_CC1N_IRQHandler
TIMER7_CC2_CC2N_IRQHandler
TIMER7_CC3_CC3N_IRQHandler
TIMER1_CC0_IRQHandler
TIMER1_CC1_IRQHandler
TIMER1_CC2_IRQHandler
TIMER1_CC3_IRQHandler
TIMER2_CC0_IRQHandler
TIMER2_CC1_IRQHandler
TIMER2_CC2_IRQHandler
TIMER2_CC3_IRQHandler
FWDGT_IRQHandler
ETH_IRQHandler
ETH_WKUP_IRQHandler
ETH_TX_IRQHandler
ETH_RX_IRQHandler
ETH_SAFETY_IRQHandler
RCU_CK_FAIL_IRQHandler
CAN5_ECCERR_IRQHandler
TIMER60_BRK_UP_TRG_CMT_IRQHandler
TIMER61_BRK_UP_TRG_CMT_IRQHandler
TIMER62_BRK_UP_TRG_CMT_IRQHandler
TIMER63_BRK_UP_TRG_CMT_IRQHandler
TIMER5_CH0_UP_IRQHandler
TIMER5_CH1_UP_IRQHandler
TIMER5_CH2_UP_IRQHandler
TIMER5_CH3_UP_IRQHandler
TIMER6_CH0_UP_IRQHandler
TIMER6_CH1_UP_IRQHandler
TIMER6_CH2_UP_IRQHandler
TIMER6_CH3_UP_IRQHandler
CAN6_ECCERR_IRQHandler
CAN7_ECCERR_IRQHandler
                B       .
                ENDP

                ALIGN

; user Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC
                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR
                ENDP

                ALIGN

                ENDIF

                END
